#Задача1 
#Сумма чисел трехзначного числа
'''
n=int(input('enter a three-digit number:  '))
a=n%10
b=n%100//10
c=n//100
print("the sum of the digits of the number:" , a+b+c)
'''

#Задача 2 Сколько всего журавликов сделают
'''
a=int(input('Количество журавликов Сережи:  '))
b=a
c=(a+b)*2
print(a+b+c)
'''

